/*
প্রবলেম ডিসকাশনঃ
এই প্রবলেমটা স্ট্রিং রিলেটেড। প্রবলেমটা সল্ভ করতে স্ট্রিং এর মোটামুটি ব্যাসিক থাকলেই হবে।

প্রবলেমে একটা বাচ্চার কথা বলা আছে , যে কিনা শুধু ১ ২ ৩ ইংলিশে লিখতে পারে।
কিন্তু লিখতে গেলে সঠিক বানান  লিখতে পারে না ,একটা অক্ষর ভুল লিখে।

এখন যে কাজটি করতে বলা হয়েছে , সেটা হল  1 2 3  সে  ভুল বানান লিখা সত্তেও সঠিক
অউটপুট  দেখাতে হবে।

এই প্রবলেমটিতে স্ট্রিং এর লেন্থ আগে বের করে নিতে পারলে সুবিধা হবে।
সাম্পল ইনপুট অউটপুট  থেকে দেখা যায়  ১ ও ২ এর লেথ একই। আর ৩ এর লেন্থ ৫।
তো লেন্থ বের করে ৩ কে সহজেই আইডেন্টিফাই করতে পারি।

এখন ১ আর ২ বের করার পালা। প্রবলেমে আগেই বলে দিয়েছে বাচ্চাটা বানান লিখতে ১ টা অক্ষর ভূল করে।

এখন  সে 1 লিখতে পারে   "o_e , _ne , on_" এভাবে
আর
2 লিখতে পারে "tw_ , t_o , _wo" ।

এখন কন্ডিশ্ন দিয়ে কম্পেয়ার করে কোনটার জন্য ১ আর  কোনটার জন্য ২ বের করে প্রিন্ট করে দিতে পারলেই
প্রবলেম সল্ভ ।


কোড ইমপ্লিমেন্টেশনঃ */

#include<stdio.h>
#include<string.h>
int main()
{
    char s[5];
    int i,n,l;
    scanf("%d",&n);
    for(i=0;i<n;i++)
    {
            scanf("%s",s);
            l=strlen(s);
            if(l==5)
                printf("3\n");
            else if(l==3)
                if(s[0]=='t'&&s[2]=='o'||s[1]=='w'&&s[2]=='o'||s[0]=='t'&&s[1]=='w')
                printf("2\n");
            else if(s[0]=='o'&&s[2]=='e'||s[1]=='n'&&s[2]=='e'||s[0]=='o'&&s[1]=='n')
                printf("1\n");
    }
    return 0;
}
